Repository: FlameGemini/Ardel
Catalog: src/Ardel.Launcher/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_cn

# Mod_DetailRetry
source: Retry
ja_jp: 再試行
zh_cn: 重试

# Mod_InstallPreferred
source: Matched
ja_jp: 一致
zh_cn: 已匹配

# Mod_InstallFileName
source: File name
ja_jp: ファイル名
zh_cn: 目标文件名

# Mod_InstallDependencyJobName
source: {0} (dependency) → {1}
ja_jp: {0}（依存関係）→ {1}
zh_cn: {0}（依赖）→ {1}

# Mod_InstallMissingDepsTitle
source: Missing dependencies
ja_jp: 依存関係が不足しています
zh_cn: 缺少依赖

# Mod_InstallMissingDepsBody
source: This mod requires {1} dependencies that are not installed on this instance: {0} Install them together, or install only this mod?
ja_jp: この Mod には、このインスタンスにインストールされていない {1} 個の依存関係が必要です： {0} すべてまとめてインストールしますか？それともこの Mod のみインストールしますか？
zh_cn: 此模组需要 {1} 个尚未安装在此实例上的依赖： {0} 要一并安装，还是只安装此模组？

# Mod_InstallModOnly
source: Install mod only
ja_jp: この Mod のみインストール
zh_cn: 仅安装此模组

# Mod_InstallWithDependencies
source: Install all ({0})
ja_jp: すべてインストール（{0} 件）
zh_cn: 全部安装（{0} 个）

# Mod_InstallCheckingDeps
source: Checking dependencies…
ja_jp: 依存関係を確認中…
zh_cn: 正在检查依赖…

# Mod_InstallDownloading
source: Downloading resource…
ja_jp: リソースをダウンロード中…
zh_cn: 正在下载资源…

# Mod_InstallProgress
source: Downloading {0}
ja_jp: {0} をダウンロード中
zh_cn: 正在下载 {0}

# Mod_InstallComplete
source: Installed {0} into {1}
ja_jp: {0} を {1} にインストールしました
zh_cn: 已将 {0} 安装到 {1}

# Mod_InstallModpackUnavailable
source: Modpack install is not available yet.
ja_jp: 統合パックのインストールはまだ利用できません。
zh_cn: 整合包安装尚未开放。

# Modpack_DialogTitle
source: Install modpack
ja_jp: 統合パックをインストール
zh_cn: 安装整合包

# Modpack_InstallTitle
source: Install {0}
ja_jp: {0} をインストール
zh_cn: 安装 {0}

# Modpack_InstanceName
source: Instance name
ja_jp: インスタンス名
zh_cn: 实例名称

# Modpack_InstanceNamePlaceholder
source: Folder name under versions/
ja_jp: versions/ 下のフォルダー名
zh_cn: versions/ 下的文件夹名

# Modpack_InstallHint
source: Creates a new isolated instance, installs the required loader, then downloads pack files.
ja_jp: 新しい隔離インスタンスを作成し、必要なローダーを入れたあと、パックのファイルをダウンロードします。
zh_cn: 将创建独立实例，安装所需加载器，再下载整合包文件。

# Modpack_Installing
source: Installing modpack…
ja_jp: 統合パックをインストール中…
zh_cn: 正在安装整合包…

# Modpack_DownloadingPack
source: Downloading modpack archive…
ja_jp: 統合パックをダウンロード中…
zh_cn: 正在下载整合包…

# Modpack_Parsing
source: Reading modpack manifest…
ja_jp: 統合パックのマニフェストを読み取り中…
zh_cn: 正在读取整合包清单…

# Modpack_InstallingLoader
source: Installing Minecraft {0} + loader…
ja_jp: Minecraft {0} とローダーをインストール中…
zh_cn: 正在安装 Minecraft {0} 与加载器…

# Modpack_ApplyingOverrides
source: Applying overrides…
ja_jp: オーバーライドを適用中…
zh_cn: 正在应用覆盖文件…

# Modpack_InstallComplete
source: Modpack installed as {0}
ja_jp: 統合パックを {0} としてインストールしました
zh_cn: 整合包已安装为 {0}

# Modpack_InvalidManifest
source: Invalid modpack manifest.
ja_jp: 統合パックのマニフェストが無効です。
zh_cn: 整合包清单无效。

# Modpack_MissingManifest
source: No CurseForge manifest.json found in the archive.
ja_jp: アーカイブに CurseForge の manifest.json がありません。
zh_cn: 压缩包中未找到 CurseForge manifest.json。

# Modpack_MissingMrpackIndex
source: No modrinth.index.json found in the archive.
ja_jp: アーカイブに modrinth.index.json がありません。
zh_cn: 压缩包中未找到 modrinth.index.json。

# Modpack_MissingMinecraft
source: Modpack does not specify a Minecraft version.
ja_jp: 統合パックに Minecraft バージョンがありません。
zh_cn: 整合包未指定 Minecraft 版本。

# Modpack_UnsupportedLoader
source: This modpack uses an unsupported loader.
ja_jp: この統合パックは未対応のローダーを使用しています（Quilt は未対応です）。
zh_cn: 此整合包使用了尚不支持的加载器（暂不支持 Quilt）。

# Modpack_UnsafePath
source: Unsafe pack path rejected: {0}
ja_jp: 安全でないパスを拒否しました: {0}
zh_cn: 已拒绝不安全路径：{0}

# Modpack_HashMismatch
source: Downloaded file failed hash verification.
ja_jp: ダウンロードしたファイルのハッシュが一致しません。
zh_cn: 下载文件校验失败。

# Modpack_UnresolvedFiles
source: {0} pack files could not be resolved from CurseForge. First: {1}
ja_jp: CurseForge から {0} 件のパックファイルを解決できません。最初: {1}
zh_cn: {0} 个整合包文件无法从 CurseForge 解析。首个：{1}

# Modpack_FileDownloadFailed
source: {0} pack files failed. First error: {1}
ja_jp: {0} 件のファイル取得に失敗。最初のエラー: {1}
zh_cn: {0} 个文件下载失败。首个错误：{1}

# Modpack_FileDownloadFailedGeneric
source: Could not download a pack file.
ja_jp: パックファイルをダウンロードできませんでした。
zh_cn: 无法下载整合包文件。

# Modpack_ResolvingFiles
source: Resolving pack files…
ja_jp: 統合パックのファイルを解決中…
zh_cn: 正在解析整合包文件…

# Modpack_MissingFile
source: Missing pack file: {0}
ja_jp: 統合パックのファイルが不足しています: {0}
zh_cn: 缺少整合包文件：{0}

# Modpack_ViewMods
source: Mods
ja_jp: Mod
zh_cn: 模组

# Modpack_Install
source: Install
ja_jp: インストール
zh_cn: 安装

# Modpack_ContentsTitle
source: Included mods
ja_jp: 含まれる Mod
zh_cn: 包含的模组

# Modpack_ContentsSubtitle
source: {0} · {1} mods
ja_jp: {0} · Mod {1} 個
zh_cn: {0} · {1} 个模组

# Modpack_ContentsLoading
source: Loading pack contents…
ja_jp: パック内容を読み込み中…
zh_cn: 正在加载整合包内容…

# Modpack_ContentsEmpty
source: No included mods were listed for this version.
ja_jp: このバージョンに含まれる Mod は一覧にありません。
zh_cn: 此版本未列出包含的模组。

# Modpack_ContentsCount
source: {0} mods
ja_jp: Mod {0} 個
zh_cn: {0} 个模组

# Modpack_OpenInLauncher
source: Open in Ardel
ja_jp: ランチャーで開く
zh_cn: 在启动器内打开

# Modpack_ImportTitle
source: Import modpack
ja_jp: 統合パックをインポート
zh_cn: 导入整合包

# Modpack_ImportSectionHint
source: Install a local Modrinth (.mrpack) or CurseForge modpack as a new instance.
ja_jp: ローカルの Modrinth (.mrpack) または CurseForge 統合パックを新しいインスタンスとしてインストールします。
zh_cn: 将本地 Modrinth（.mrpack）或 CurseForge 整合包安装为新实例。

# Modpack_ImportBrowse
source: Import from file…
ja_jp: ファイルからインポート…
zh_cn: 从文件导入…

# Modpack_ImportDropHint
source: You can also drag a .mrpack or CurseForge zip onto the window.
ja_jp: .mrpack または CurseForge の zip ファイルをウィンドウにドラッグすることもできます。
zh_cn: 也可以把 .mrpack 或 CurseForge zip 拖到窗口上。

# Modpack_ExportDialogTitle
source: Export modpack
ja_jp: 統合パックのエクスポート
zh_cn: 导出整合包

# Modpack_ExportDialogSubtitle
source: Choose what to include. Thin packs download known mods from Modrinth instead of embedding jars.
ja_jp: 含める項目を選択してください。軽量パックは JAR を埋め込む代わりに Modrinth から既知の Mod をダウンロードします。
zh_cn: 选择要包含的内容。精简包会从 Modrinth 下载已知模组，而不是嵌入 jar。

# Modpack_ExportIncludeHeading
source: Include
ja_jp: 含める項目
zh_cn: 包含

# Modpack_ExportIncludeMods
source: Mods
ja_jp: Mod
zh_cn: 模组

# Modpack_ExportIncludeConfig
source: Config
ja_jp: 設定 (config)
zh_cn: 配置

# Modpack_ExportIncludeResourcePacks
source: Resource packs
ja_jp: リソースパック
zh_cn: 材质包

# Modpack_ExportIncludeShaderPacks
source: Shader packs
ja_jp: シェーダーパック
zh_cn: 光影包

# Modpack_ExportIncludeDatapacks
source: Datapacks
ja_jp: データパック
zh_cn: 数据包

# Modpack_ExportIncludeOptions
source: Options / servers
ja_jp: オプション / サーバー
zh_cn: 选项 / 服务器

# Modpack_ExportIncludeSaves
source: Worlds (saves)
ja_jp: ワールド (セーブデータ)
zh_cn: 存档

# Modpack_ExportIncludeScreenshots
source: Screenshots
ja_jp: スクリーンショット
zh_cn: 截图

# Modpack_ExportThinPack
source: Prefer thin pack (Modrinth downloads)
ja_jp: 軽量パックを優先（Modrinth からダウンロード）
zh_cn: 优先精简包（Modrinth 下载）

# Modpack_ExportThinPackHint
source: Jars found on Modrinth go into files[] with URLs; others stay in overrides/.
ja_jp: Modrinth で見つかった JAR は URL 付きで files[] に記録され、その他は overrides/ に保存されます。
zh_cn: 能在 Modrinth 匹配到的 jar 写入 files[]；其余放入 overrides/。

# Modpack_ExportUnsupportedLoader
source: This instance’s loader cannot be exported as an .mrpack.
ja_jp: このインスタンスのローダーは .mrpack としてエクスポートできません。
zh_cn: 此实例的加载器无法导出为 .mrpack。

# Modpack_ExportResolvingThin
source: Resolving mods on Modrinth…
ja_jp: Modrinth で Mod を照合中…
zh_cn: 正在 Modrinth 上解析模组…

# Modpack_ExportThinProgress
source: Resolved {0}/{1} mods…
ja_jp: {0}/{1} 個の Mod を照合完了…
zh_cn: 已解析 {0}/{1} 个模组…

# Mod_InstallFile
source: Install
ja_jp: インストール
zh_cn: 安装

# Settings_Title
source: Settings
ja_jp: 設定
zh_cn: 设置

# Settings_JavaPlaceholder
source: Auto / not selected
ja_jp: 自動 / 未選択
zh_cn: 自动 / 未选择

# Settings_MaxMemory
source: Max memory
ja_jp: 最大メモリ
zh_cn: 最大内存

# Memory_Custom
source: Custom
ja_jp: カスタム
zh_cn: 自定义

# Memory_FollowDefault
source: Follow launcher defaults
ja_jp: 既定設定に従う
zh_cn: 跟随默认配置

# Memory_FollowDefaultCustom
source: Uses the launcher default maximum: {0} MB.
ja_jp: ランチャー既定の最大値を使用します：{0} MB。
zh_cn: 使用启动器默认最大值：{0} MB。

# Memory_FollowDefaultDynamic
source: Uses the launcher default: dynamic allocation at launch.
ja_jp: ランチャー既定：起動時に動的割り当て。
zh_cn: 使用启动器默认：启动时动态分配。

# Memory_Dynamic
source: Dynamic allocation
ja_jp: 動的メモリ割り当て
zh_cn: 动态内存分配

# Memory_DynamicHint
source: At launch, scales heap targets with the mods folder size and claims free system RAM in tiers, keeping an OS reserve.
ja_jp: 起動時に mods 数で目標ヒープを上げ、空きメモリを段階的に割り当て、OS 用の余裕を残します。
zh_cn: 启动时按 mods 数量抬高目标堆，再按可用内存分档分配，并为系统保留余量。

# Settings_BmclTitle
source: BMCLAPI mirror
ja_jp: BMCLAPI ミラー
zh_cn: BMCLAPI 镜像

# Settings_BmclHint
source: Community mirror that usually speeds up Minecraft assets, libraries, and loader downloads in Asia (and other regions where Mojang CDNs are slow)
ja_jp: コミュニティミラー。アジアなど公式 CDN が遅い地域で、アセット・ライブラリ・ローダー取得を速くしやすい
zh_cn: 社区镜像，通常能加快亚洲等地的游戏资源、依赖库与加载器下载（官方 CDN 偏慢时尤其有用）

# Settings_ArdoTitle
source: Ardo download engine
ja_jp: Ardo ダウンロードエンジン
zh_cn: Ardo 下载引擎

# Settings_ArdoHint
source: Controls parallel downloads, speed limits, and integrity checks for game files.
ja_jp: ゲームファイルの並列ダウンロード、速度制限、整合性チェックを制御します。
zh_cn: 控制游戏文件并行下载、限速与完整性校验。

# Settings_ArdoThreads
source: Download threads
ja_jp: ダウンロードスレッド数
zh_cn: 下载线程数

# Settings_ArdoSpeedLimit
source: Speed limit (KB/s)
ja_jp: 速度制限 (KB/s)
zh_cn: 限速 (KB/s)

# Settings_ArdoSpeedLimitHint
source: 0 = unlimited
ja_jp: 0 = 無制限
zh_cn: 0 = 不限速

# Settings_ArdoChunkSize
source: Chunk size (MiB)
ja_jp: チャンクサイズ (MiB)
zh_cn: 分块大小 (MiB)

# Settings_ArdoVerifySha1
source: Verify SHA1 after download
ja_jp: ダウンロード後に SHA1 を検証
zh_cn: 下载后校验 SHA1

# Settings_ArdoMaxRetries
source: Retries per file
ja_jp: ファイルごとの再試行回数
zh_cn: 单文件重试次数

# Settings_ArdoSummary
source: Ardo · {0} threads · {1}
ja_jp: Ardo · {0} スレッド · {1}
zh_cn: Ardo · {0} 线程 · {1}

# Settings_ArdoUnlimited
source: no limit
ja_jp: 制限なし
zh_cn: 不限速

# Settings_BehaviorTitle
source: After game launch
ja_jp: ゲーム起動後
zh_cn: 游戏启动后

# Settings_BehaviorHint
source: What to do with Ardel’s window, mirrors, and logs once the game has started.
ja_jp: ゲーム起動後の Ardel のウィンドウ、ミラー、ログの処理です。
zh_cn: 游戏成功启动后，对 Ardel 窗口、镜像与日志的处理。

# Settings_PostLaunchAction
source: Window action
ja_jp: ウィンドウ操作
zh_cn: 窗口操作

# Settings_PostLaunchNone
source: Do nothing
ja_jp: 何もしない
zh_cn: 不操作

# Settings_PostLaunchMinimize
source: Minimize Ardel
ja_jp: Ardel を最小化
zh_cn: 最小化 Ardel

# Settings_PostLaunchMinimizeUntilExit
source: Minimize until game exits
ja_jp: ゲーム終了まで最小化
zh_cn: 最小化直至游戏退出

# Settings_PostLaunchExit
source: Exit Ardel
ja_jp: Ardel を終了
zh_cn: 退出 Ardel

# Settings_BmclUsageMode
source: Mirror usage
ja_jp: ミラーの使用
zh_cn: 镜像使用条件

# Settings_BmclUsageAlways
source: Always use BMCLAPI
ja_jp: 常に BMCLAPI を使用
zh_cn: 始终使用 BMCLAPI

# Settings_BmclUsageFallback
source: Fallback when official is slow
ja_jp: 公式が遅いときはフォールバック
zh_cn: 官方较慢时回退 BMCLAPI

# Settings_BmclUsageDisabledHint
source: Enable the BMCLAPI mirror above to configure usage.
ja_jp: 使用を設定するには、上の BMCLAPI ミラーを有効にしてください。
zh_cn: 请先开启上方 BMCLAPI 镜像开关。

# Settings_GameLogViewer
source: Game log viewer
ja_jp: ゲームログビューアー
zh_cn: 游戏日志查看器

# Settings_GameLogViewerHint
source: Open a separate window that tails latest.log when the game starts (does not close Ardel when the game exits).
ja_jp: Open a separate window that tails latest.log when the game starts.
zh_cn: 启动游戏时打开独立窗口跟踪 latest.log（关闭游戏不会退出 Ardel）。

# Settings_ResourceRepairTitle
source: Resource repair
ja_jp: リソース修復
zh_cn: 资源补全

# Settings_ResourceRepairHint
source: Scan and repair game files before launch.
ja_jp: 起動前にゲームファイルをスキャンして修復します。
zh_cn: 启动前扫描并补全缺失的游戏文件。

# Settings_ResourceRepairEnabled
source: Enable resource repair
ja_jp: リソース修復を有効にする
zh_cn: 启用资源补全

# Settings_ResourceRepairConcurrency
source: Max parallel checks
ja_jp: 最大並列チェック数
zh_cn: 最大并行数

# Settings_ResourceVerifyMode
source: Verify mode before launch
ja_jp: 起動前の検証モード
zh_cn: 启动前校验模式

# Settings_ResourceVerifyTrustReady
source: Trust .ardel-ready marker
ja_jp: .ardel-ready マーカーを信頼
zh_cn: 信任 .ardel-ready 标记

# Settings_ResourceVerifyQuick
source: Quick existence check
ja_jp: クイック存在確認
zh_cn: 快速存在性检查

# Settings_ResourceVerifyFull
source: Full SHA1 verify
ja_jp: 完全 SHA1 検証
zh_cn: 完整 SHA1 校验

# Settings_ResourceRepairAutoDownload
source: Auto-download missing files
ja_jp: 不足ファイルを自動ダウンロード
zh_cn: 缺失时自动下载

# Settings_ResourceRepairWriteReady
source: Write .ardel-ready when complete
ja_jp: 完了時に .ardel-ready を書き込む
zh_cn: 完成后写入 .ardel-ready

# Settings_ResourceRepairBlockLaunch
source: Block launch on repair failure
ja_jp: 修復失敗時に起動をブロック
zh_cn: 失败时阻止启动

# Settings_CrashAnalysisTitle
source: Crash analysis
ja_jp: クラッシュ分析
zh_cn: 崩溃分析

# Settings_CrashAnalysisHint
source: Only opens when a crash-report or hs_err from this session exists (or a native abort exit). Speaks only for matched log patterns — prefer miss over a wrong diagnosis. Soft guesses are disabled.
ja_jp: 高確信度の原因があるときだけ提示します。不明な場合はログを開き ChatGPT への相談を案内します。通常終了では表示しません。
zh_cn: 仅在本会话有 crash-report / hs_err（或原生异常退出码）时弹出；只陈述命中的日志模式（宁可漏报，不可误报）。软猜测已关闭。

# Settings_CrashAnalysisEnabled
source: Enable crash analysis
ja_jp: クラッシュ分析を有効にする
zh_cn: 启用崩溃分析

# Settings_CrashAnalysisOnForceKill
source: Show on force stop
ja_jp: 強制終了時にも表示
zh_cn: 强制结束也弹出

# Settings_CrashAnalysisAutoOpenLogs
source: Open logs folder automatically
ja_jp: ログフォルダーを自動で開く
zh_cn: 自动打开日志目录

# Settings_CrashAnalysisKeepRecent
source: Keep recent reports
ja_jp: 最近のレポートを保持
zh_cn: 保留最近报告数

# Settings_CrashAnalysisPreIndex
source: Pre-index log paths at launch
ja_jp: 起動時にログパスを事前インデックス
zh_cn: 启动时预索引日志路径

# Settings_CrashAnalysisVerbose
source: Verbose debug info
ja_jp: 詳細なデバッグ情報
zh_cn: 详细调试信息

# Settings_CrashAnalysisShowConfidence
source: Show confidence percentage
ja_jp: 確信度のパーセンテージを表示
zh_cn: 显示置信度百分比

# Settings_DialogDebugTitle
source: Crash dialog layout (dev)
ja_jp: クラッシュダイアログのレイアウト（開発用）
zh_cn: 崩溃弹窗排版（开发）

# Settings_DialogDebugDevLabel
source: DEV ONLY
ja_jp: 開発用
zh_cn: 仅开发调试

# Settings_DialogDebugEntry
source: Open crash-dialog layout check…
ja_jp: クラッシュダイアログのレイアウト確認を開く…
zh_cn: 打开崩溃弹窗排版检查…

# Settings_DialogDebugHint
source: Layout check only (Loc title/explain/solution). Does not invent crash-reports or log excerpts. Real analysis only quotes files on disk.
ja_jp: レイアウト確認専用です（Loc タイトル/説明/解決策）。クラッシュレポートやログの抜粋を捏造することはありません。実際の分析ではディスク上のファイルのみを引用します。
zh_cn: 只检查版式与 Loc 文案。不编造 crash-report，不伪造日志摘录。正式分析只引用磁盘上的真实文件。

# Settings_DialogDebugCrashSection
source: Crash dialog layouts
ja_jp: クラッシュダイアログのレイアウト
zh_cn: 崩溃弹窗版式

# Settings_DialogDebugCrashKnown
source: Known layout
ja_jp: 既知のレイアウト
zh_cn: Known 版式

# Settings_DialogDebugCrashSuspected
source: Suspected layout
ja_jp: 推定されるレイアウト
zh_cn: 疑似版式

# Settings_DialogDebugCrashUnknown
source: Unknown layout
ja_jp: 不明なレイアウト
zh_cn: Unknown 版式

# Settings_DialogDebugPickRule
source: Rule Loc to preview
ja_jp: プレビューするルール Loc
zh_cn: 要预览的规则文案

# Settings_DialogDebugPreviewSelected
source: Show
ja_jp: 表示
zh_cn: 显示

# GameLog_Title
source: Game log
ja_jp: ゲームログ
zh_cn: 游戏日志

# GameLog_Waiting
source: Waiting for latest.log…
ja_jp: latest.log を待機中…
zh_cn: 等待 latest.log…

# Settings_Off
source: Off
ja_jp: オフ
zh_cn: 关

# Settings_On
source: On
ja_jp: オン
zh_cn: 开

# Settings_GameDirectory
source: Game directory
ja_jp: ゲームディレクトリ
zh_cn: 游戏目录

# Settings_GameDirectoryHint
source: Fixed to .minecraft next to the exe (portable). Version isolation is forced: each version has its own mods / saves / config.
ja_jp: 実行ファイル横の .minecraft に固定（ポータブル）。バージョン分離が強制され、各バージョンに独自の mods / saves / config があります。
zh_cn: 固定为程序旁的 .minecraft（便携）。强制版本隔离：每个版本有独立的 mods / saves / config。

# Settings_SourceBmcl
source: Download source: BMCLAPI
ja_jp: ダウンロード元: BMCLAPI
zh_cn: 下载源：BMCLAPI

# Settings_SourceOfficial
source: Download source: Official
ja_jp: ダウンロード元: 公式
zh_cn: 下载源：官方

# Settings_FoundJava
source: Found {0} Java install(s)
ja_jp: {0} 件の Java を検出
zh_cn: 找到 {0} 个 Java 安装

# Settings_ScanFailed
source: Scan failed: {0}
ja_jp: スキャンに失敗しました: {0}
zh_cn: 扫描失败：{0}

# Settings_SelectJavaExe
source: Please select java.exe
ja_jp: java.exe を選択してください
zh_cn: 请选择 java.exe

# Settings_JavaUpdated
source: Java path updated
ja_jp: Java パスを更新しました
zh_cn: Java 路径已更新

# Settings_BrowseFailed
source: Browse failed: {0}
ja_jp: 参照に失敗しました: {0}
zh_cn: 浏览失败：{0}

# Settings_CannotOpenFolder
source: Cannot open folder: {0}
ja_jp: フォルダーを開けません: {0}
zh_cn: 无法打开文件夹：{0}

# Settings_Saved
source: Saved
ja_jp: 保存しました
zh_cn: 已保存

# Settings_SaveFailed
source: Save failed: {0}
ja_jp: 保存に失敗しました: {0}
zh_cn: 保存失败：{0}

# Settings_JavaAuto
source: Java will be chosen automatically
ja_jp: Java は自動で選択されます
zh_cn: 将自动选择 Java

# Settings_JavaNone
source: No Java found. Scan again or browse to java.exe.
ja_jp: Java が見つかりません。再スキャンするか java.exe を参照してください。
zh_cn: 未找到 Java。请重新扫描或浏览到 java.exe。

# Settings_JavaSelected
source: Using Java {0}
ja_jp: Java {0} を使用
zh_cn: 使用 Java {0}

# Settings_Language
source: Language
ja_jp: 言語
zh_cn: 语言

# Settings_LanguageSystem
source: System default
ja_jp: システム既定
zh_cn: 跟随系统

# Settings_LanguageChineseTraditional
source: Traditional Chinese
ja_jp: 繁體中文
zh_cn: 繁體中文

# Settings_LanguageRestartHint
source: Applies immediately across the launcher.
ja_jp: 選択するとすぐに反映されます。
zh_cn: 选择后立即生效。

# Settings_RestartNow
source: Apply
ja_jp: 適用
zh_cn: 应用

# Settings_LanguageApplied
source: Language: {0} · nav sample: {1}
ja_jp: 言語: {0} · ナビ例: {1}
zh_cn: 语言：{0} · 导航示例：{1}

# Settings_ScanningJava
source: Scanning Java…
ja_jp: Java をスキャン中…
zh_cn: 正在扫描 Java…

# Settings_Theme
source: Theme
ja_jp: テーマ
zh_cn: 主题

# Settings_ThemeDefault
source: Follow system
ja_jp: システム既定
zh_cn: 跟随系统

# Settings_ThemeLight
source: Light
ja_jp: ライト
zh_cn: 浅色

# Settings_ThemeDark
source: Dark
ja_jp: ダーク
zh_cn: 深色

# Settings_ThemeSakura
source: Sakura Pink
ja_jp: 桜ピンク
zh_cn: 樱花粉

# Settings_ThemeSamoyed
source: Samoyed
ja_jp: サモエド
zh_cn: 萨摩耶

# Settings_ThemeSweden
source: Sweden
ja_jp: スウェーデン
zh_cn: 瑞典

# Settings_ThemeArctic
source: Arctic
ja_jp: アークティック
zh_cn: 极地

# Settings_ThemeAurora
source: Aurora
ja_jp: オーロラ
zh_cn: 极光

# Settings_ThemeCedar
source: Cedar
ja_jp: シダー
zh_cn: 雪松

# Settings_ThemeCinder
source: Cinder
ja_jp: シンダー
zh_cn: 炉灰

# Settings_ThemeHoney
source: Honey
ja_jp: ハニー
zh_cn: 蜂蜜

# Settings_ThemeMoss
source: Moss
ja_jp: モス
zh_cn: 苔藓

# Settings_ThemeObsidian
source: Obsidian
ja_jp: オブシディアン
zh_cn: 黑曜

# Settings_ThemePeach
source: Peach
ja_jp: ピーチ
zh_cn: 蜜桃

# Settings_ThemeTwilight
source: Twilight
ja_jp: トワイライト
zh_cn: 暮色

# Settings_ThemeDescDefault
source: Follows Windows light/dark mode with the same palette as Light and Dark, and Mica.
ja_jp: Windows のライト/ダークに合わせ、Light/Dark と同じパレットと Mica を使います。
zh_cn: 跟随 Windows 深浅色模式，与浅色/深色主题使用相同色板，并启用云母材质。

# Settings_ThemeDescLight
source: A bright, clean interface with a classic blue accent.
ja_jp: 明るくクリーンなクラシックブルーのインターフェース。
zh_cn: 明亮干净的界面，搭配经典蓝色强调色。

# Settings_ThemeDescDark
source: A sleek dark interface with a soft gray accent.
ja_jp: シンプルなダーク基調にソフトグレーのアクセント。
zh_cn: 简洁深色界面，搭配柔和灰色强调色。

# Settings_ThemeDescSakura
source: A soft pastel pink theme with strawberry accents.
ja_jp: やさしい桜ピンクのテーマにストロベリーのアクセント。
zh_cn: 柔和樱花粉主题，搭配草莓粉点缀。

# Settings_ThemeDescSamoyed
source: A cozy white fluffy Samoyed fur texture background with cool blue-gray accents. — Dedicated to the memory of my beloved Samoyed.
ja_jp: もふもふのサモエドの毛並み背景とクールなブルーグレーのアクセント。—— 愛するサモエドの思い出に捧げます。
zh_cn: 雪白的萨摩耶蓬松绒毛背景，搭配冰川蓝灰点缀。—— 谨以此主题纪念我亲爱的萨摩耶。

# Settings_ThemeDescSweden
source: A Scandinavian light shell with Swedish blue and gold accents.
ja_jp: スウェーデンの青と金色アクセントのスカンジナビア風ライトテーマ。
zh_cn: 北欧浅色界面，搭配瑞典蓝与金黄强调色。

# Settings_ThemeDescArctic
source: A cold near-white shell with ice-blue accents.
ja_jp: 冷たいオフホワイトのシェルにアイスブルーのアクセント。
zh_cn: 近白冷色界面，搭配冰蓝强调色。

# Settings_ThemeDescAurora
source: A night-blue canvas with aurora green accents.
ja_jp: 夜のブルーキャンバスにオーロラグリーンのアクセント。
zh_cn: 夜蓝画布，搭配极光青绿强调色。

# Settings_ThemeDescCedar
source: Warm wood tones with cedar-brown accents.
ja_jp: 温かい木目調にシダーブラウンのアクセント。
zh_cn: 暖木质感，搭配雪松褐强调色。

# Settings_ThemeDescCinder
source: Charcoal night with ember-orange accents.
ja_jp: 木炭の夜にエンバーオレンジのアクセント。
zh_cn: 炭灰夜色，搭配烬橙强调色。

# Settings_ThemeDescHoney
source: Cream canvas with honey-gold accents.
ja_jp: クリームのキャンバスにハニーゴールドのアクセント。
zh_cn: 奶油底色，搭配蜜金强调色。

# Settings_ThemeDescMoss
source: Quiet forest dark with moss-green accents.
ja_jp: 静かな森のダークにモスグリーンのアクセント。
zh_cn: 安静的森林深色，搭配苔绿强调色。

# Settings_ThemeDescObsidian
source: Near-black, sharp corners, pale graphite accents.
ja_jp: ほぼ黒の鋭い角に淡いグラファイトのアクセント。
zh_cn: 近黑锐角界面，搭配浅石墨强调色。

# Settings_ThemeDescPeach
source: Soft peach shell with ripe coral accents.
ja_jp: やわらかいピーチのシェルにコーラルのアクセント。
zh_cn: 柔和蜜桃色壳，搭配熟珊瑚色强调。

# Settings_ThemeDescTwilight
source: Dusk-blue night with muted violet-blue accents.
ja_jp: 黄昏のブルーにミュートした紫藍のアクセント。
zh_cn: 暮蓝夜色，搭配灰紫蓝强调色。

# Settings_StartupSplash
source: Startup splash
ja_jp: 起動スプラッシュ
zh_cn: 启动徽标

# Settings_StartupSplashDesc
source: Customize the Ardel badge screen shown while the launcher starts.
ja_jp: 起動時に表示される Ardel バッジ画面をカスタマイズします。
zh_cn: 自定义启动时显示的 Ardel 徽标页。

# Settings_StartupSplashEnabled
source: Show startup splash
ja_jp: 起動スプラッシュを表示
zh_cn: 显示启动徽标

# Settings_StartupSplashProgress
source: Show progress bar
ja_jp: プログレスバーを表示
zh_cn: 显示进度条

# Settings_StartupSplashDuration
source: Minimum display time
ja_jp: 最短表示時間
zh_cn: 最短显示时长

# Settings_StartupSplashDurationHint
source: How long the splash stays visible at minimum (1000–12000 ms).
ja_jp: スプラッシュが最低限表示される時間（1000–12000 ms）。
zh_cn: 徽标页至少停留的时间（1000–12000 毫秒）。

# Settings_StartupSplashBrand
source: Show Ardel badge
ja_jp: Ardel バッジを表示
zh_cn: 显示 Ardel 徽标

# Settings_StartupSplashPreview
source: Preview splash
ja_jp: スプラッシュをプレビュー
zh_cn: 预览徽标页

# Settings_StartupSplashPreviewDone
source: Splash preview finished.
ja_jp: スプラッシュのプレビューが完了しました。
zh_cn: 徽标页预览已完成。

# Settings_StartupSplashPreviewDisabled
source: Enable the startup splash to preview it.
ja_jp: プレビューするには起動スプラッシュを有効にしてください。
zh_cn: 请先开启启动徽标后再预览。

# Settings_QuickLaunch
source: Quick launch
ja_jp: クイック起動
zh_cn: 快捷启动

# Settings_QuickLaunchDesc
source: Control the Home quick-launch button for your pinned instance.
ja_jp: ホームの固定インスタンス用クイック起動ボタンを制御します。
zh_cn: 控制主页上固定实例的快捷启动按钮。

# Settings_QuickLaunchShowOnHome
source: Show quick launch button on Home
ja_jp: ホームにクイック起動ボタンを表示
zh_cn: 在主页显示快捷启动按钮

# Settings_HomeWidgets
source: Home widgets
ja_jp: ホームウィジェット
zh_cn: 主页小组件

# Settings_HomeWidgetsDesc
source: Show weather and date at the top of the Home page. Set a region to enable weather.
ja_jp: ホーム上部の天気と日付。天気には地域の設定が必要です。
zh_cn: 主页顶部显示天气和日期。天气需先设置地区。

# Settings_HomeWidgetsShowWeather
source: Show weather
ja_jp: 天気を表示
zh_cn: 显示天气

# Settings_HomeWidgetsShowCalendar
source: Show date
ja_jp: 日付を表示
zh_cn: 显示日期

# Settings_HomeWidgetsUse12HourClock
source: Use 12-hour clock (AM/PM)
ja_jp: 12時間制を使用（AM/PM）
zh_cn: 使用 12 小时制（AM/PM）

# Settings_HomeWidgetsRegion
source: Weather region
ja_jp: 天気の地域
zh_cn: 天气地区

# Settings_HomeWidgetsRegionHint
source: Open the region dialog to search, or use current location.
ja_jp: 「地域を選択」で検索ウィンドウを開きます。英語の地名を使ってください。
zh_cn: 点击「选择地区」搜索，或使用当前位置。

# Settings_HomeWidgetsRegionEnglishTip
source: Search by city name in your language, or use current location.
ja_jp: 英語の地名で検索してください。
zh_cn: 可用中文或英文搜索城市，也可使用当前位置。

# Settings_HomeWidgetsRegionPlaceholder
source: City name
ja_jp: 都市名
zh_cn: 城市名

# Settings_HomeWidgetsRegionDialogTitle
source: Choose weather region
ja_jp: 天気の地域を選択
zh_cn: 选择天气地区

# Settings_HomeWidgetsChooseRegion
source: Choose region…
ja_jp: 地域を選択…
zh_cn: 选择地区…

# Settings_HomeWidgetsRegionNone
source: No region set
ja_jp: 地域未設定
zh_cn: 尚未设置地区

# Settings_HomeWidgetsSearching
source: Searching…
ja_jp: 検索中…
zh_cn: 正在搜索…

# Settings_HomeWidgetsNoResults
source: No places found. Try another spelling.
ja_jp: 場所が見つかりません。英語の地名で試してください。
zh_cn: 未找到。请换个写法再试。

# Settings_HomeWidgetsSearchFailed
source: Search failed: {0}
ja_jp: 検索に失敗しました: {0}
zh_cn: 搜索失败：{0}

# Settings_HomeWidgetsClearRegion
source: Clear region
ja_jp: 地域をクリア
zh_cn: 清除地区
